# Доп задание 10.

# * Полезное задание на конвейер. Использовать команду cut на вывод длинного списка 
# каталога, чтобы отобразить только права доступа к файлам. Затем отправить в конвейере 
# этот вывод на sort и uniq, чтобы отфильтровать все повторяющиеся строки. 
# Потом с помощью wc подсчитать различные типы разрешений в этом каталоге. 
# Самостоятельно решить задачу, как сделать так, чтобы в подсчет не добавлялись 
# строка Итого и файлы . и .. (ссылки на текущую и родительскую директории)

# Примечание. Задания с 7 по 9 даны для тех, кому упражнений 1-6 показалось недостаточно.
