# Доп. задание 3. 

# *Написать регулярное выражение, которое проверяет, является выведенное значение «белым» IP-адресом 
# (5.255.255.5 подойдет, а 172.16.0.1 — нет).

# Список шаблонов серых адресов:
# 192.168.xxx.xxx
# 172.16.xxx.xxx
# 10.xxx.xxx.xxx
# 127.xxx.xxx.xxx
# 169.254.xxx.xxx
((([0-2][0-5]{2})|(1[0-9]{2})|([0-9]{2})|([0-9]))\.)(?<!10\.|127\.)((([0-2][0-5]{2})|(1[0-9]{2})|([0-9]{2})|([0-9]))\.)(?<!192\.168\.|172\.16\.|169\.254\.)((([0-2][0-5]{2})|(1[0-9]{2})|([0-9]{2})|([0-9]))\.)(([0-2][0-5]{2})|(1[0-9]{2})|([0-9]{2})|([0-9]))
