# Задание.

# Задание выполняется в одиночку (в этом случае нужно два разных аккаунта на github) либо в парах. 
# Нужно создать репозиторий, другим аккаунтом (или другому участнику) сделать его форк, 
# внести изменение, сделать Pull Request. Далее следует смержить Pull Request.
# Коллеги, можете сделать форк репозитория который мы создали на уроке и отправлять пулл запросы туда-же: 
# https://github.com/victorchengb/linux_gb

# Fork, изменения, Pull Request сделаны, отправлено на смерживание:
https://github.com/victorchengb/linux_gb/pull/30/commits/234892319c941dcda8124bc2a77a3a239df818ab
